#+TITLE: Primera parte: Git y Github
#+STARTUP: indent
#+EMAIL: <fraya@ieszaidinvergeles.org>
#+LANG: es
#+SETUPFILE: ~/Plantillas/white_clean.theme

Crearemos un proyecto básico con una aplicación web escrita en [[https://www.python.org/][Python]]
con el framework [[https://flask.palletsprojects.com/en/stable][Flask]].

* La aplicación

Crearemos un directorio llamado ~git-terraform-ansible~ y dentro
tendremos la siguiente estructura:

#+begin_src sh :results output
tree ..
#+end_src

#+RESULTS:
#+begin_example
..
├── doc
│   └── git.org
├── LICENSE
├── README.md
└── src
    ├── app
    │   ├── app.py
    │   └── requirements.txt
    └── nginx
        └── flask_app

5 directories, 6 files
#+end_example

